[TestCase("text", new[] { "text" })]
[TestCase("hello world", new[] { "hello", "world" })]
[TestCase("''", new[] { "" })]
[TestCase("", new string[0])]
[TestCase("' '", new[] { " " })]
[TestCase("\"\\\\", new[] { "\\" })] //Слэш внутри и перед кавычками
[TestCase("Слово", new[] { "Слово" })]
[TestCase("Слово с 'кавычками'", new[] { "Слово", "с", "кавычками" })]
[TestCase(" Пробел в конце или начале ", new[] { "Пробел", "в", "конце", "или", "начале" })]
[TestCase("Разделение слов по большому     пробелу", new[] { "Разделение", "слов", "по", "большому", "пробелу" })]
[TestCase("\"Пробел с незакрытой кавычкой ", new[] { "Пробел с незакрытой кавычкой " })]
[TestCase("\"'Одинарные кавычки в двойных'\"", new[] { "'Одинарные кавычки в двойных'" })]
[TestCase("'\"Двойные кавычки в одинарных\"'", new[] { "\"Двойные кавычки в одинарных\"" })]
[TestCase("\"Незакрытая кавычка", new[] { "Незакрытая кавычка" })]
[TestCase("Разделитель'без'пробелов", new[] { "Разделитель", "без", "пробелов" })]
[TestCase("Простое поле 'после' поля в кавычках", new[] { "Простое", "поле", "после", "поля", "в", "кавычках", })]
[TestCase("\'\\\'Экранированные одинарные в одинарных\\\'\'", new[] { "\'Экранированные одинарные в одинарных\'" })]
[TestCase("\"\\\"Экранированные двойные в двойных\\\"\"", new[] { "\"Экранированные двойные в двойных\"" })]

public static void RunTests(string input, string[] expectedOutput)
{   // Тело метода изменять не нужно
    Test(input, expectedOutput);
}